#include <iostream>
#include <vector>
#include <Windows.h>
#include "firm.h"
#include "tourist.h"
#include "agency.h"
#include "plane.h"
#include "storage.h"

using namespace std;
using namespace objects;


int main() {
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    vector<Tourist> tourists;

    tourists.emplace_back(
        Tourist(

            "Целевич Йосип", 26, 0,
            "Хеліос", "Шоп-тур", 24.07, 27.07, "Ейфелева вежа", "Одяг", "Літо",62735, "Круг", "Синій", 1, 2, "ДжойнАп",
            true, 1, 6254, 0.045
        )
    );



    tourists.emplace_back(
        Tourist(

            "Міцкевич Світлана", 54, 1,
            "Пелікан", "Відпочинок", 13.06, 18.06, "Ейфелева вежа", "Одяг", "Літо", 48675, "Квадрат", "Жовтий", 2, 5, "АнексТур",
            false, 2, 1234, 0.056
        )
    );


    tourists.emplace_back(
        Tourist(

            "Скрипка Степан", 12, 0,
            "Медічі", "Діти", 23.09, 28.09, "Музей вина", "Одяг", "Осінь", 66444, "Трикутник", "Зелений", 2, 2, "КоралТревел",
            true, 3, 5478, 0.012
        )
    );


    tourists.emplace_back(
        Tourist(


            "Кохман Юлія", 75, 1,
            "Медічі", "Відпочинок", 12.01, 16.01, "Ейфелева вежа", "Їжа", "Зима", 66444, "Круг", "Жовтий", 1, 1, "Анекс Тур",
            false, 2, 6574, 0.042
        )
    );


    tourists.emplace_back(
        Tourist(


            "Дочман Артем", 25, 0,
            "Пелікан", "Шоп-тур", 11.06, 16.06, "Лувр", "Годинники", "Зима", 22222, "Квадрат", "Зелений", 1, 1, "ДжойнАп",
            true, 3, 7432, 0.016

        )
    );

    tourists.emplace_back(
        Tourist(


            "Мирна Любов", 42, 1,
            "Хеліос", "Відпочинок", 08.06, 14.06, "Лувр", "Прикраси", "Весна", 62735, "Трикутник", "Синій", 3, 4, "СтоПунд",
            true, 1, 6514, 0.065
        )
    );
    tourists.emplace_back(
        Tourist(


            "Крупа Максим", 74, 0,
            "Пелікан", "Шоп-тур", 09.09, 14.09, "Лувр", "Годинники", "Осінь", 66444, "Квадарт", "Зелений", 1, 7, "ДжойнАп",
            false, 2, 4657, 0.004
        )
    );


    tourists.emplace_back(
        Tourist(

            "Рибна Катерина", 14, 1,
            "Медічі", "Діти", 12.03, 19.03, "Рейн", "Одяг", "Весна", 22222, "Круг", "Жовтий", 2, 5, "КоралТревел",
            false, 4, 3214, 0.078
        )
    );


    tourists.emplace_back(
        Tourist(


            "Трикутна Дарина", 18, 1,
            "Хеліос", "Відпочинок", 16.05, 18.05, "Музей вина", "Одяг", "Весна", 66444, "Трикутник", "Зелений", 1, 3, "СтоПунд",
            true, 3, 456, 0.012
        )
    );


    tourists.emplace_back(
        Tourist(


            "Вакарчук Святослав", 42, 0,
            "Пелікан", "Шоп-тур", 16.06, 18.06, "Музей вина", "Годинники", "Літо", 22222, "Квадрат", "Зелений", 2, 3, "АнексТур",
            true, 4, 608, 0.011
        )
    );


    tourists.emplace_back(
        Tourist(


            "Григоренко Григорій", 81, 0,
            "Хеліос", "Шоп-тур", 16.07, 18.07, "Музей вина", "Одяг", "Літо", 62735, "Трикутник", "Зелений", 1, 3, "КоралТревел",
            false, 4, 909, 0.010
        )
    );


    tourists.emplace_back(
        Tourist(


            "Тарасенко Василина", 32, 1,
            "Пелікан", "Відпочинок", 12.01, 16.01, "Музей вина", "Прикраси", "Зима", 48675, "Трикутник", "Зелений", 1, 5, "КоралТревел",
            true, 2, 890, 0.005
        )
    );


    tourists.emplace_back(
        Tourist(


            "Ектор Браво", 18, 0,
            "Медічі", "Відпочинок", 26.09, 28.09, "Ейфелева вежа", "Одяг", "Осінь", 48675, "Квадрат", "Жовтий", 1, 3, "ДжойнАп",
            true, 1, 122, 0.012
        )
    );


    tourists.emplace_back(
        Tourist(


            "Соловій Христина", 28, 1,
            "Хеліос", "Шоп-тур", 21.05, 28.05, "Вісла", "Прикраси", "Весна", 62735, "Круг", "Синій", 1, 3, "ДжойнАп",
            true, 3, 528, 0.08
        )
    );

    tourists.emplace_back(
        Tourist(


            "Червона Розалія", 24, 1,
            "Пелікан", "Відпочинок", 14.05, 20.05, "Музей вина", "Одяг", "Весна", 62735, "Трикутник", "Зелений", 2, 3, "АнексТур",
            true, 3, 4560, 0.09
        )
    );


    vector<Agency> agencies;

    auto agency = Agency("ДжойнАп", 5);

    agency.excursions.emplace_back("Ейфелева вежа");
    agency.excursions.emplace_back("Лувр");
    agency.excursions.emplace_back("Музей вина");
    agency.popular = "Ейфелева вежа, Лувр";

    agencies.emplace_back(agency);


    agency = Agency("КоралТревел", 3);

    agency.excursions.emplace_back("Ейфелева вежа");
    agency.excursions.emplace_back("Музей вина");
    agency.excursions.emplace_back("Вісла");
    agency.popular = "Музей вина, Вісла";

    agencies.emplace_back(agency);



    agency = Agency("АнексТур", 4);

    agency.excursions.emplace_back("Ейфелева вежа");
    agency.excursions.emplace_back("Лувр");
    agency.popular = "Ейфелева вежа";

    agencies.emplace_back(agency);

    agency = Agency("Стопунд", 1);

    agency.excursions.emplace_back("Музей вина");
    agency.excursions.emplace_back("Лувр");
    agency.excursions.emplace_back("Вісла");
    agency.popular = "Музей вина, Лувр, Вісла";

    agencies.emplace_back(agency);


    vector<Plane> planes;


    planes.emplace_back(
        Plane(
            62735,
            3.3,
            15,
            48
        )
    );


    planes.emplace_back(
        Plane(
            48675,
            5.2,
            18,
            12
        )
    );


    planes.emplace_back(
        Plane(
            66444,
            2.2,
            8,
            4
        )
    );

    planes.emplace_back(
        Plane(
            22222,
            2.4,
            6,
            8
        )
    );


    Storage storage(45555, 45, 12, 57, 16);

    vector <Firm> firms;

    firms.emplace_back(
        Firm(
            62735,
            4783,
            1234.2,
            5694.405,
            5489303.1,
            39483.1,
            26543.1,
            2920399.1,
            34567.1,
            "Літо",
            "ДжойнАп"
        )
    );


    firms.emplace_back(
        Firm(
            48675,
            2345,
            2234.2,
            6934.405,
            43943.1,
            25623.1,
            23443.1,
            893038.1,
            29374.1,
            "Осінь",
            "АнексТур"
        )
    );


    firms.emplace_back(
        Firm(
            66444,
            2367,
            3234.2,
            5804.405,
            20388.1,
            25623.1,
            98443.1,
            47399.1,
            96787.1,
            "Зима",
            "СтоПунд"
        )
    );

    firms.emplace_back(
        Firm(
            22222,
            8976,
            4234.2,
            5694.405,
            3399303.1,
            10823.1,
            765843.1,
            90399.1,
            43537.1,
            "Весна",
            "КоралТревел"
        )
    );


    bool running = true;

    while (running)
    {
        system("cls");

        cout << " ______________________________________________________________ " << std::endl
            << "|          АІС ТУРИСТИЧНОЇ ФІРМИ В ЗАРУБІЖНІЙ КРАЇНІ            |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << " _______________________________________________________________ " << std::endl
            << "|                        Виберіть опцію:                        |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|                      [1] Список туристів                      |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|   [2] Списки на розселення туристів за вказаними готелями     |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|       [3] Списки туристів, які відвідали Францію              |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|              [4] Відомості про конкретного туриста            |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "| [5] Список готелів, у яких проводиться розселення туристів    |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|   [6] Загальна кількість туристів, які замовили екскурсії     |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|[7]Найпопулярніші екскурсії і найякісніші екскурсійні агентства|" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|             [8] Дані про завантаження рейсу                   |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|              [9] Статистика про вантажообіг складу            |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|                   [10] Повний фінансовий звіт                 |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|                 [11] Дані про витрати і доходи                |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|          [12] Статистика відправленого вантажу                |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|           [13] Рентабельність представництва                   |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|[14]Відсоткове відношення туристів(відпочиваючих до shop-турів)|" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|           [15] Відомості про туристів зазначеного рейсу       |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << "|                   [16] Завершити роботу                       |" << std::endl
            << "|_______________________________________________________________|" << std::endl
            << " _______________________________________________________________" << std::endl
            << endl;


        int input;
        cin >> input;
        cout << endl;

        if (input == 1)
        {

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|                   [1] Список туристів                         |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;


            for (auto& tourist : tourists)
            {
                tourist.print();


            }
        }


            

        if (input == 2)
        {

            string hotel;

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|   [2] Списки на розселення туристів за вказаними готелями     |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

            cout << "Введіть назву готелю: " << endl;
            cin >> hotel;

            for (auto& tourist : tourists)
            {
                if (tourist.hotel == hotel)
                {
                    tourist.print();
                }
            }
        }



        if (input == 3)
        {

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|          [3] Списки туристів, які відвідали Францію           |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

            string time;
            cout << "Введіть обраний період перебування: " << endl;
            cin >> time;

            for (auto& tourist : tourists)
            {
                if (tourist.time == time)
                {
                    tourist.print();
                }
            }
        }



        if (input == 4)
        {

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|            [4] Відомості про конкретного туриста              |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

            string name;
            cout << "Введіть ім'я: " << endl;
            cin.ignore();
            getline(cin, name);

            for (auto& tourist : tourists)


            {
                if (tourist.name == name)
                {
                    tourist.print(true);
                }
            }
        }



        if (input == 5)
        {

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|  [5] Список готелів, у яких проводиться розселення туристів   |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

    
            string hotel;
            cout << "Розселення проводиться в готелях ДжойнАп/АнексТур/КоралТревел. Введіть назву готелю, який вас цікавить: " << endl;
            cin >> hotel;

            for (auto& tourist : tourists)
            {
                if (tourist.hotel == hotel)
                {
                    tourist.printHotel();
                }
            }
        }



        if (input == 6)
        {

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|    [6] Загальна кількість туристів, які замовили екскурсію    |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

            string places;
            cout << "Введіть назву обраної екскурсії: " << endl;
            cin.ignore(38000, '\n');
            getline(cin,places);

            int counter = 0;
            for (auto& tourist : tourists)
                if (tourist.places == places)
                {
                    tourist.print();
                    counter++;
                }
            cout << "Кількість туристів, які замовили екскурсії: "
                << counter << endl;
        }



        if (input == 7)
        {
            system("cls");

            cout << " ________________________________________________________________" << std::endl
                << "|[7] Найпопулярніші екскурсії та найякісніші екскурсійні агентства|" << std::endl
                << "|_________________________________________________________________|" << std::endl
                << endl;

            for (auto& agency : agencies)
                {
                    agency.print();
                }
        }



        if (input == 8)
        {

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|               [8] Дані про завантаження рейсу                 |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;


            int number;
            cout << "Введіть номер рейсу: " << endl;
            cin >> number;

            for (auto& plane : planes)
            {
                if (plane.number == number)
                {
                    plane.print();
                }
            }
        }



        if (input == 9)
        {

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|            [9] Статистика про вантажообіг складу              |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

            storage.print();
        }



        if (input == 10)
        {

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|                 [10] Повний фінансовий звіт                   |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

            string group;
            cout << "Введіть номер групи: " << endl;
            cin.ignore();
            getline(cin, group);

            for (auto& tourist : tourists)
            {
                if (tourist.group == stoi(group))
                {
                    tourist.printFinances();
                }
            }
        }



        if (input == 11)
        {

            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|               [11] Дані про витрати і доходи                  |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

            string hour;
            cout << "Оберіть пору року:" << endl;
            cin >> hour;

            string rentability;
            cout << "Введіть назву представництва (агенції): " << endl;
            cin >> rentability;

            for (auto& firm : firms) {
                if ((firm.hour == hour) && (firm.rentability == rentability)) {

                    firm.printServiceLosses();
                }
            }
        }



        if (input == 12)
        {
            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|             [12] Статистика відправленого вантажу             |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

            for (auto& firm : firms) {
                firm.printCargo();
            }
        }



        if (input == 13)
        {
            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|          [13] Рентабельність представництва                   |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;

            string rentability;
            cout << "Введіть назву агенції: " << endl;
            cin >> rentability;

            for (auto& firm : firms)
            {
                if (firm.rentability == rentability)
                {
                    firm.printRentability();
                }
            }
        }



        if (input == 14)
        {
            system("cls");

            cout << " ________________________________________________________________" << std::endl
                << "|[14] Відсоткове відношення туристів (відпочиваючих до shop-турів)|" << std::endl
                << "|_________________________________________________________________|" << std::endl
                << endl;

            string time;
            cout << "Введіть пору року: " << endl;
            cin >> time;

            auto counter_shop = 0,
                counter_resting = 0;


            for (auto& tourist : tourists)
            {
                if ((tourist.category == "Шоп-тур") &&(tourist.time == time))
                {


                    counter_shop++;
                }
                if ((tourist.category == "Відпочинок") && (tourist.time == time))
                {
                    counter_resting++;
                }
            }

            cout << "Відношення туристів Відпочиваючих до Шоп-турів (%): "
                << static_cast<double>(counter_resting) / (counter_shop) << endl;
        }



        if (input == 15)
        {
            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|         [15] Відомості про туристів зазначеного рейсу         |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;


            int race;
            cout << "Введіть номер рейсу: " << endl;
            cin >> race;

            for (auto& tourist : tourists)
            {
                if (tourist.race == race)
                {
                    tourist.printRaceInfo();
                }
            }
        }



        if (input == 16)
        {
            system("cls");

            cout << " _______________________________________________________________" << std::endl
                << "|                 [16] Завершити роботу                         |" << std::endl
                << "|_______________________________________________________________|" << std::endl
                << endl;



            running = false;



        }



        system("pause>nul");
    }
}
